artillery-config.yml
config:
  target: 'http://localhost:4000'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'
    # Ramp up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp up'
    # Sustained load
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    # Peak load
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
    # Cool down
    - duration: 30
      arrivalRate: 10
      name: 'Cool down'
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  
  processor: './artillery-processor.js'
  
  variables:
    baseUrl: 'http://localhost:4000'

scenarios:
  # Health check scenario
  - name: 'Health Check'
    weight: 5
    flow:
      - get:
          url: '/health'
          capture:
            - json: '$.status'
              as: 'healthStatus'

  # Authentication scenario
  - name: 'User Authentication Flow'
    weight: 20
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'test{{ $randomNumber() }}@example.com'
            password: 'Test@1234'
          capture:
            - json: '$.data.accessToken'
              as: 'authToken'
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: 'data.accessToken'

  # Product browsing scenario
  - name: 'Browse Products'
    weight: 30
    flow:
      - get:
          url: '/products?page=1&limit=20'
          expect:
            - statusCode: 200
            - contentType: json
      - think: 2
      - get:
          url: '/products?category=Pain Relief&page=1&limit=20'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/products/search?q=paracetamol'
          expect:
            - statusCode: 200

  # Order creation scenario
  - name: 'Create Order'
    weight: 15
    flow:
      # Login first
      - post:
          url: '/auth/login'
          json:
            email: 'customer@example.com'
            password: 'Test@1234'
          capture:
            - json: '$.data.accessToken'
              as: 'authToken'
      - think: 1
      # Create order
      - post:
          url: '/orders'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          json:
            items:
              - productId: '{{ productId }}'
                quantity: 2
            deliveryAddress:
              street: '123 Main St'
              city: 'Lagos'
              state: 'Lagos'
              country: 'Nigeria'
          expect:
            - statusCode: 201

  # Payment initialization scenario
  - name: 'Initialize Payment'
    weight: 10
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'customer@example.com'
            password: 'Test@1234'
          capture:
            - json: '$.data.accessToken'
              as: 'authToken'
      - post:
          url: '/payments/initialize'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          json:
            gateway: 'paystack'
            amount: 10000
            currency: 'NGN'
            email: 'customer@example.com'
          expect:
            - statusCode: 201
            - hasProperty: 'reference'

  # Inventory check scenario
  - name: 'Check Inventory'
    weight: 10
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'vendor@example.com'
            password: 'Test@1234'
          capture:
            - json: '$.data.accessToken'
              as: 'authToken'
      - get:
          url: '/inventory?vendorId={{ vendorId }}'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200

  # Dashboard metrics scenario
  - name: 'Dashboard Metrics'
    weight: 10
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'admin@example.com'
            password: 'Test@1234'
          capture:
            - json: '$.data.accessToken'
              as: 'authToken'
      - get:
          url: '/reports/dashboard'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/reports/sales?period=monthly'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200